{
    "original_id": "52895",
    "name": "Angielskie Śniadanie",
    "category": "sniadanie",
    "image_filename": "52895_English_Breakfast.jpg",
    "time": "30-45 min",
    "difficulty": "Średni",
    "portions": "2-4",
    "ingredients": [
        "2 kiełbaski",
        "3 plastry boczku",
        "2 pieczarki",
        "2 pomidory",
        "1 plaster kaszanki",
        "2 jajka",
        "1 plaster chleba"
    ],
    "steps": [
        "Rozgrzej grill lub patelnię grillową na niskim ogniu i lekko posmaruj oliwą.",
        "Najpierw ugotuj kiełbaski.",
        "Umieść kiełbaski na najgorętszej części grilla lub w najchłodniejszej, jeśli jest różnica, i gotuj powoli przez 15-20 minut, obracając od czasu do czasu, aż będą złociste.",
        "Po pierwszych 10 minutach zwiększ ogień do średniego, aby przygotować pozostałe składniki.",
        "Jeśli brakuje miejsca, całkowicie ugotuj kiełbaski i trzymaj je w cieple na talerzu w piekarniku.",
        "W boczku nacinaj kilka małych nacięć na tłustej krawędzi.",
        "Połóż boczek na grillu i smaż przez 2-4 minuty z każdej strony, aż osiągnie pożądaną chrupkość.",
        "Pieczarki oczyść pędzelkiem, odetnij trzon do poziomu kapelusza.",
        "Dopraw solą i pieprzem, skrop oliwą, ustaw trzonem do góry i smaż 1-2 minuty, potem obróć i smaż 3-4 minuty więcej.",
        "Nie przesuwaj pieczarek zbyt często, aby nie puściły soków i nie zrobiły się miękkie.",
        "Pomidory przekrój w poprzek lub wzdłuż na pół, usuń zielony 'rdzeń'.",
        "Dopraw solą i pieprzem, skrop oliwą, ułóż przecięciem do dołu i smaż 2 minuty, następnie obróć i dopraw ponownie, smaż kolejne 2-3 minuty.",
        "Kaszankę pokrój na 3-4 plastry, usuń skórkę, smaż 1,5-2 minuty z każdej strony, aż lekko się zarumieni.",
        "Chleb smaż najlepiej na osobnej patelni, najlepiej używając chleba 2-dniowego, po 2-3 minuty z każdej strony aż będzie złocisty i chrupiący. Dodaj masło po obróceniu dla smaku.",
        "Jajka wbij na patelnię obok smażonego chleba, dodaj kawałek masła i lekko polewaj nim jajko podczas smażenia, dopraw do smaku.",
        "Po ugotowaniu wszystkich składników, podawaj od razu na ciepłych talerzach z ketchupem lub brązowym sosem."
    ]
}
